using Lab10;
using Lab10.Blue;

namespace Lab10
{
    public class Program
    {
        public static void Main()
        {
            ISerializer<Lab9.Blue.Blue> manager = new BlueTxtFileManager<Lab9.Blue.Blue>("test");
            var file = (IFileManager)manager;
            var control = (IFileLifeController)manager;

            var folder = Path.Combine(Environment.GetFolderPath(Environment.SpecialFolder.Desktop), "Lab10");
            Directory.CreateDirectory(folder);

            file.SelectFolder(folder);
            //for (int i = 0; i < 4; i++)
            {
                int i = 0;
                file.ChangeFileName($"task{i}");
                Lab9.Blue.Blue task = null;
                if (i == 0) task = new Lab9.Blue.Task1("После многолетних исследований ученые обнаружили тревожную тенденцию в вырубке лесов Амазонии. Анализ данных показал, что основной участник разрушения лесного покрова – человеческая деятельность. За последние десятилетия рост объема вырубки достиг критических показателей. Главными факторами, способствующими этому, являются промышленные рубки, производство древесины, расширение сельскохозяйственных угодий и незаконная добыча древесины. Это приводит к серьезным экологическим последствиям, таким как потеря биоразнообразия, ухудшение климата и угроза вымирания многих видов животных и растений.");
                if (i == 1) task = new Lab9.Blue.Task2("После многолетних исследований ученые обнаружили тревожную тенденцию в вырубке лесов Амазонии. Анализ данных показал, что основной участник разрушения лесного покрова – человеческая деятельность. За последние десятилетия рост объема вырубки достиг критических показателей. Главными факторами, способствующими этому, являются промышленные рубки, производство древесины, расширение сельскохозяйственных угодий и незаконная добыча древесины. Это приводит к серьезным экологическим последствиям, таким как потеря биоразнообразия, ухудшение климата и угроза вымирания многих видов животных и растений.", "ос");
                if (i == 2) task = new Lab9.Blue.Task3("После многолетних исследований ученые обнаружили тревожную тенденцию в вырубке лесов Амазонии. Анализ данных показал, что основной участник разрушения лесного покрова – человеческая деятельность. За последние десятилетия рост объема вырубки достиг критических показателей. Главными факторами, способствующими этому, являются промышленные рубки, производство древесины, расширение сельскохозяйственных угодий и незаконная добыча древесины. Это приводит к серьезным экологическим последствиям, таким как потеря биоразнообразия, ухудшение климата и угроза вымирания многих видов животных и растений.");
                if (i == 3) task = new Lab9.Blue.Task4("После многолетних исследований ученые обнаружили тревожную тенденцию в вырубке лесов Амазонии. Анализ данных показал, что основной участник разрушения лесного покрова – человеческая деятельность. За последние десятилетия рост объема вырубки достиг критических показателей. Главными факторами, способствующими этому, являются промышленные рубки, производство древесины, расширение сельскохозяйственных угодий и незаконная добыча древесины. Это приводит к серьезным экологическим последствиям, таким как потеря биоразнообразия, ухудшение климата и угроза вымирания многих видов животных и растений.");
                task.Review();
                manager.Serialize(task);

                if (true)
                {
                    control.EditFile("REWRITE");
                }

                Lab9.Blue.Blue obj = manager.Deserialize();
                Console.WriteLine(obj.ToString());
            }
        }
    }
}