namespace Lab9
{
    public class Program
    {
        public static void Main()
        {
            var str = new Purple.Task1("");
            str.ChangeText("После многолетних исследований ученые обнаружили тревожную тенденцию в вырубке лесов Амазонии. Анализ данных показал, что основной участник разрушения лесного покрова – человеческая деятельность. За последние десятилетия рост объема вырубки достиг критических показателей. Главными факторами, способствующими этому, являются промышленные рубки, производство древесины, расширение сельскохозяйственных угодий и незаконная добыча древесины. Это приводит к серьезным экологическим последствиям, таким как потеря биоразнообразия, ухудшение климата и угроза вымирания многих видов животных и растений.");
            Console.WriteLine(str.Input);
            string result = str.ToString();
            Console.WriteLine(result);
        }
    }
}